export function fibonacci(n: number): number[] {
  if (n === 0) {
    return []
  } else if (n === 1) {
    return [0]
  } else {
    const sequence = [0, 1]
    for (let i = 2; i < n; i++) {
      const nextTerm = sequence[i - 1] + sequence[i - 2]
      sequence.push(nextTerm)
    }
    return sequence
  }
}

/*
Првично се прави проверка дали n е 0. Ако n е 0, тогаш враќа празен низа [], бидејќи нема потреба да генерира било кои броеви за 0 термини во низата.
Следната проверка е дали n е 1. Ако n е 1, тогаш враќа низа со само 0 [0], бидејќи првиот број во Фибоначиевата низа е 0.
Ако n не е 0 или 1, тогаш се извршува for циклус кој ги генерира броевите на Фибоначиевата низа. 
Во овој случај, почнувајки од 2-риот број, секој следен број е збир на последните два броја. Броевите се додаваат во низата sequence.
Циклусот се извршува за n - 2 пати, бидејќи првите два броја се веќе поставени во sequence.
На крај, функцијата ја враќа генерираната Фибоначиева низа.
*/
